narmesk/testjules1/PIC18FREMOTE/glcd.c
    screen_x = curr_x;
    screen_y = y;

    while (str[i] != '\0')
    {
        if (curr_x + 6 > 192) break; // Ekran genişlik sınırını aşma

        unsigned char c = str[i];
        if (c < 0x20 || c > 0x7E) c = ' ';
        unsigned short font_idx = (c - 0x20) * 5;

        for (unsigned char k = 0; k < 5; k++)
        {
            screen_x = curr_x;
            GLCD_WriteData(font5x7[font_idx + k]);
            curr_x++;
        }

        screen_x = curr_x;
        GLCD_WriteData(0x00);
        curr_x++;

        i++;
    }
}

void GLCDPutChar5x7(unsigned char c)
{
    if (c < 0x20 || c > 0x7E) c = ' ';
    c -= 0x20;
    unsigned short index = c * 5;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    tx = tx + 6;
}

void GLCD_StringArialBold14(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutChar_ArialBold14(str[i]);
    }
}

void GLCDPutChar_ArialBold14(unsigned char c)
{
    unsigned char width;
    unsigned short index;
    unsigned char data;
    unsigned short j;
    unsigned short jj;
    unsigned short page;
    c -= 0x20;
    if (c != 0)
    {
        index = ((Arial_bold_14_index[c - 1]) * 2) + 0x60 + FONT_WIDTH_TABLE;
    }
    else
    {
        index = 0x60 + FONT_WIDTH_TABLE;
    }
    width = Arial_bold_14[FONT_WIDTH_TABLE + c];
    Coord.x = tx;
    Coord.y = ty;
    jj = index + width;
    for (j = index; j < jj; j++)
    {
        data = Arial_bold_14[j];
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    page = width + index;
    jj += width;
    for (j = page; j < jj; j++)
    {
        data = Arial_bold_14[j];
        data >>= 2;
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    tx = tx + width + 1;
}

void GLCD_StringCalibri36(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutCharCalibri36(str[i]);
    }
}

void GLCDPutCharCalibri36(unsigned char c)
{
    unsigned char width = 0;
    unsigned short index;
    unsigned short page;
    unsigned char data;
    unsigned short j;
    unsigned short jj;
    c -= 0x20;
    if (c != 0)
    {
        index = Calibri36_index[c - 1] + 0x7 + FONT_WIDTH_TABLE;
    }
    else
    {
        index = 0x7 + FONT_WIDTH_TABLE;
    }
    width = Calibri36[FONT_WIDTH_TABLE + c];
    Coord.x = tx;
    Coord.y = ty;
    page = index;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    page = index + width;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + (2 * width);
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + (3 * width);
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + 4 * width;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        data = Calibri36[j];
        data >>= 4;
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + width + 1;
}

void GLCD_StringHead8x8(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutCharHead8x8(str[i]);
    }
}

void GLCDPutCharHead8x8(unsigned char c)
{
    unsigned short index;
    index = (c * 8) + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 9;
}

void GLCDPutCharDigMin(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (22 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 12;
}

void GLCDPutSpecialCharDigMin(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (22 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx - 1;
    Coord.y = ty;
    index++;
    index++;
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx - 1;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 5;
}

void GLCDPutSpecialCharDigMax(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    index++;
    index++;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 5;
}

